{"inkVersion":20,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"main":["^Phew, we didn't get caught! ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^It was a close one though! We'll have to be careful from now on.  ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^If we want to get further into Dusk's base, we will have to employ some tactics of physical penetration testers- ",{"#":"portrait:console_neutral"},"\n","^Stop laughing! I promise it's really called that and it's a real thing! ",{"#":"portrait:console_wat"},"\n","^Alright then, how do we penetrate the base? ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^A penetration test is a way of testing a system's security by attacking it externally and trying to gain access to sensitive ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^information.","\n","^Isn't that just hacking? That can't be legal. ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^What differentiates penetration testing from hacking is that pen-testers are hired by the system's owner, so the pen-tester has ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^permission to attack the system.","\n","^Hackers act without permission.","\n","^Hey Siri, my games console is pressuring me into criminal acts. ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^Oh come on, loosen up! We're here to save the world! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^*Disclaimer: the characters' actions are not encouraged by the game's creator in real life. ",{"#":"portrait:console_neutral"},"\n","^Anyway. Physical penetration testing involves an attempt to gain access to a building and its computer systems without any","\n","^employee realising that the pen-tester is an unauthorised outsider.","\n","^This sounds like a reverse escape room!  ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^But there's no way that's possible. Surely it's easy to recognise an intruder?","\n","^That's why physical pen-testers employ a number of psychological techniques to go unnoticed.",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^One of the best strategies is to confidently act like you belong here, and not many will question you.","\n","^A closely related strategy is to take on a normal, or expected, role so you don't raise suspicion.","\n","^For example, disguising yourself as a delivery worker and entering a building with a package as if that really is your job.","\n","^Or you can pretend to be an IT technician, and you may even succeed carrying a company computer out of the building! ",{"#":"portrait:console_evilexcited"},"\n","^Alright, but how do we look like we belong here right now? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Just look in the mirror! You're already wearing a lab coat, so make yourself at home. ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^You're my entry ticket to this place! Keep me in your pocket though. If you get told off for gaming, you'll attract attention.","\n","^What is our goal now then? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^This floor isn't Long Dusk's lair, so it must be on a higher floor. Try the elevator. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^Looks like we need a keycard to go up any higher... ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Hmm, let's explore this floor and see if we can find any leads on where we can get one. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","done",{"#f":1}],"soceng":["^This door is locked with a passcode! ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Good for Dusk. Access control is an important part of cybersecurity. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^You wouldn't want just anyone to be able to get to your secrets! ",{"#":"portrait:console_evilexcited"},"\n","^Okay, but that's not great for us! ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^Will we have to brute force all the possible passcodes like we did with the encryption key? ",{"#":"portrait:you_confused"},"\n","^Not so fast! Not every code can be easily brute forced. ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Looks like this door has a 4-digit code.","\n","^The number of possible codes here is 10,000!","\n","^Woah! Why so many? ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^There are 4 numbers here, and each number has a possible value between 0 and 9, inclusive.  ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^This means that each number has 10 possible values.","\n","^Since there are 4 numbers, the number for possible combinations for a 4-number code is 10^4, which is 10,000.","\n","^I can't try to input all 10,000 possible codes, I'll be here for ages and we will definitely get caught! ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^Does that mean we have to give up?","\n","^No, I have thought of another way to find the right code!  ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Instead of focusing on the digital aspect of cybersecurity, we can leverage the human aspect.","\n","^But isn't cybersecurity just for computers? How are humans involved in that? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Humans interact with computers! Since they're part of the system, they, too, have a vital role to play.  ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^We can trick an employee here to give us the code just by talking to them.","\n","^Surely we can't just ask them for the code? We'll be found out for sure! ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Of course not! We'll have to use something called social engineering. ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^What's that? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Social engineering is the act of psychologically manipulating someone into giving away sensitive information! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^That sounds scary! How will we do it? ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^Aren't you a psychology student? ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^... ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Well, the best way would be to send an email pretending we are a colleague who forgot the password, easy! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Surely no one would fall for that! That's clearly suspicious! ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Yeah, that's what they think! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^In reality, most humans fail to recognise social engineering, and that's often how cyber atacks start. ",{"#":"portrait:console_neutral"},"\n","^Are you *sure* you're a psychology student? ",{"#":"portrait:console_wat"},"\n","^Are you *sure* you're not just a smartass? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Okay, whatever, moving on.  ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^What typical cybersecurity training fails to address is that people don't expect to ever actually become involved in social ",{"#":"portrait:console_neutral"},"\n","^engineering.","\n","^They view this training as a hypothetical exercise or just something to tick off on their to-do list, and fail to actively","\n","^apply what they learned in real life.","\n","^Cybersecurity raining usually takes place in a controlled environment where the employees know to expect a test, so they are","\n","^prepared to act in a rehearsed manner.","\n","^Very few people in real life are constantly on guard, and that's why they sometimes dismiss even the most suspicious of emails.","\n","^I bet *you* wouldn't think twice before clicking on a \"sorry we missed you\" email from a delivery company and filling in your ",{"#":"portrait:console_evilexcited"},"\n","^contact information without checking if you even ordered anything first.","\n","^I wouldn't. I never order anything online, I go dumpster diving instead. ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^That's because you're a lost cause. Most other people would. ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^Anyway, let's find a way to contact an employee, and I will teach you how to take advantage of guillable people! ",{"#":"portrait:console_evilexcited"},"\n","done",{"#f":1}],"soceng2":["^Hey, look, this looks like a help stand! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Through it, we can contact a receptionist. ",{"#":"portrait:console_neutral"},"\n","^Alright, so what do we say? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^The key to a successful infiltration is to research the company first. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^You will be easily found out if you don't play your cards right. ",{"#":"portrait:console_evilexcited"},"\n","^How do we do this research then? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Look around the room - these bots are complaining about the passcode to each other while their manager is away for lunch break. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^Let's listen in on their conversation and see if we learn anything! ",{"#":"portrait:console_evilexcited"},"\n","done",{"#f":1}],"minigame":["^Now that we've done some research on the company, let's write a phishing email to get the code to the offices wing. ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^We're going fishing?! ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^No, phishing is a type of social engineering. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^Phishing often takes the form of emails, text messages, browser popups, social media comments, and even phone calls! ",{"#":"portrait:console_evilexcited"},"\n","^Phishing involves an attacker pretending to be a trustworthy entity, such as a company you're registered with, ",{"#":"portrait:console_neutral"},"\n","^to trick you into giving away your personal information.","\n","^So we're going to pretend to be someone from this company to trick the receptionist into giving away the door code? ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^So you *do* have a brain after all! Fascinating!",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^I hope you paid attention to what the bots were saying. (Press Q now to exit this dialogue if you need a refresher) ",{"#":"portrait:console_neutral"},"\n",{"#":"puzzle:phishingMinigame"},"^Navigate through the rows and columns of the word grid with the arrow keys. ",{"#":"portrait:console_neutral"},"\n","^Select all words that you heard the bots mention using the E key. You can deselect them with the same key too.","\n","^Press Enter to check your answers.","\n","^You need to select all the correct words and none of the incorrect ones! ",{"#":"portrait:console_evilexcited"},"\n","done",{"#f":1}],"email":["^I have generated a phishing email that will surely catch us that door code! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^How can you be so confident? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Because I wrote it following a special pattern! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Firstly, I used a lot of words that only the employees working at the company would know.","\n","^For example, the names of the employees.","\n","^I also mentioned parts of this workplace's culture, such as the fact that the managers go to lunch before the other employees,","\n","^or that the employees tend to write down their codes on sticky notes.","\n","^The email's context is something the receprtionist will know, too: one employee often loses his sticky note and has to be reminded","\n","^of the code often.","\n","^This way, it will look like the email came from a real employee rather than an intruder.","\n","^So the eavesdropping was to make us blend in better? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Exactly! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Another secret to a successful phishing email is to add a sense of urgency, so that the recipient doesn't have time to think over","\n","^what to do.","\n","^Is that why you asked to receive the code before lunch break is over? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Yeah! People tend to panic and make irrational decisions under pressure. ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^But what's a little time pressure without a consequence? If the recepient has no reason to hurry up, they won't bite! ",{"#":"portrait:console_neutral"},"\n","^Is that why you said that the employee will be fired if he doesn't get the code ASAP? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^What if the receptionist doesn't care about someone else getting fired?","\n","^Ah, but do you remember what the bots said? If anyone gets caught writing their codes on sticky notes, there will be a mass ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^layoff!","\n","^The receptionist will be investigated too, and her role in code sharing will be discovered!","\n","^But it's not like the employee will be caught just for forgetting his code! ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^How will management know he was using a sticky note if he just forgot the code?","\n","^Because the management expects people to remember the code! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^You're more likely to not know it if you never memorised it in the first place.","\n","^And anyway, the email can have a few plot holes here and there. ",{"#":"portrait:console_neutral"},"\n","^The aim is to get the receptionist to panic and give us the code and not think about it too much.","\n","^This is why phishing emails often work even if they don't make perfect sense.","\n","^In fact, you should always look out for poor grammar and mismatching sender email addresses in the emails you receive.","\n","^Phishing emails are surprisingly full of that! ",{"#":"portrait:console_evilexcited"},"\n","^And one final note: phishing messages often don't address you by name. They say something like \"Dear Customer\". ",{"#":"portrait:console_neutral"},"\n","^Why, did they not do enough research on me? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Actually, that's exactly the point of phishing emails! ",{"#":"portrait:console_evilexcited"},"\n","^What is? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^To trick you into giving away sensitive information, just like we are tricking the receptionist into giving away the door code! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Phishing emails often ask you to go to a fake webpage of a reputable company and fill in your personal details. ",{"#":"portrait:console_neutral"},"\n","^Phishing scams most commonly ask for your banking credentials to steal your money, so be careful where you enter them! ",{"#":"portrait:console_evilexcited"},"\n","^Alright, but back to the topic - what's wrong with writing things on sticky notes anyway? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Has Dusk outlawed them and I... Missed the memo? *badum tss* ",{"#":"portrait:you_neutral"},"\n","^... ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^No, it's because sticky notes with sensitive information can easily fall into the wrong hands!",{"#":"portrait:console_evilexcited"},"\n","^It's not secure to write that stuff down - it's much more secure to just memorise your codes!","\n","^But aren't I supposed to have a unique password for each account? There's no way I can memorise all of them! ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^That's why password managers exist! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^They're computer programs that store your passwords in an encrypted database, so all you need to remember is one secure","\n","^password to access that database.","\n","^You can sync your passwords between different devices so you're never caught off guard!","\n","^(This message is (not) sponsored by Bitwarden)","\n","^Now that I think about it, if we didn't send that phishing email we could probably just go searching for that sticky note that employee ",{"#":"portrait:console_neutral"},"\n","^lost.","\n","^It's bound to be here somewhere! ",{"#":"portrait:console_evilexcited"},"\n","^Oh no, I don't want to go on a whole easter egg hunt... ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^We don't have to! Look, we got a response to our email while we were chatting! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n",{"#":"puzzle:closePuzzle"},"^Dear ","ev",{"VAR?":"employeeName"},"out","/ev","^, ",{"#":"speaker:Info Bot"},"\n","^The passcode for the door is ","ev",{"VAR?":"passcode"},"out","/ev","^, please ensure that you remember it this time as our emails are monitored by IT and I","\n","^wouldn't want to get either of us in trouble with management.","\n","^Kind Regards, ","ev",{"VAR?":"receptionistName"},"out","/ev","\n","^We got the passcode! Let's go to the door and type it in to access the offices! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","done",{"#f":1}],"keypad":["^Hurry, lunchtime is almost over!","\n",{"#":"puzzle:KeypadPanel"},"^Let's input the passcode in here now, it's ","ev",{"VAR?":"passcode"},"out","/ev","^. ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","done",{"#f":1}],"reception":[["^It would be weird if I talk here since I'm just a games console, so you're on your own buddy. ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^What?! Uh... ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^...","\n","ev","str","^Hi, I'm trying to break into Dusk's lair","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hi, I'm here to deliver a package","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Hi, I'm a new intern and I lost my keycard","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":".^.^.^.breakin"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.delivery"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.intern"},{"#f":5}]}],{"breakin":["^...","\n","^Could you give me the keycard to the elevator please? ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^What? I don't know what kind of jokes you're playing but I hope you know that I *will* call security right now! ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^Uh oh, what were you thinking?! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^You put me on the spot! ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^Did you not listen when I explained social engineering tactics to you?! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^Never mind, I'm gonna try to remotely reset this robot's memory and you can try again.",{"#":"portrait:console_neutral"},"\n","done",{"#f":1}],"delivery":["^...","\n","^Package deliveries are on the floor below, how did you get here? ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^A security guard directed me here. ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^That's odd. Alright, where is the package? ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^Uh... I lost it?? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^This is suspicious. I'm calling security! ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^Uh oh, what were you thinking?! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^You put me on the spot! ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^Did you not listen when I explained social engineering tactics to you?! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^Never mind, I'm gonna try to remotely reset this robot's memory and you can try again.",{"#":"portrait:console_neutral"},"\n","done",{"#f":1}],"intern":["^...","\n","^I just got accepted here yesterday and my records aren't in the system yet so I can't file a formal request for a new card. ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^Could you give me a temporary card just for today please?","\n","^Hmm, I suppose I can give you a temporary card for now. ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^Here you go.","\n","^Thank you very much! ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^It will expire tomorrow so I will contact your supervisor later today to sort it out for you.",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^What is your name?","\n","^Um, it's... ","ev",{"VAR?":"firstName"},"out","/ev","^ ","ev",{"VAR?":"lastName"},"out","/ev","^. ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^Great, I'll contact your supervisor to sort it out soon. Take care! ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^Thanks, you too! ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^Nice work! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^What was that sound? ",{"#":"speaker:receptionist"},{"#":"portrait:Default"},"\n","^... ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","^... ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^Run! ",{"#":"portrait:console_evilexcited"},"\n","done",{"#f":1}],"#f":1}],"nitrozest":["^(The fizzy green liquid smells citrusy)",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","done",{"#f":1}],"pool":["^(There's something slimy and vaguely humanoid bubbling at the bottom of the pool.) ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","done",{"#f":1}],"painting":["^(You're not sure if this is a window or a painting) ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","done",{"#f":1}],"food":["^(The food is plastic) ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","done",{"#f":1}],"managers":["^(These must be all the manager robots.) ",{"#":"speaker:You"},{"#":"portrait:you_neutral"},"\n","done",{"#f":1}],"battle":["^Halt! I have been summoned to take care of intruders! ",{"#":"speaker:Guard Bot"},{"#":"portrait:Default"},"\n","^What?! How did it find out about us? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^There are no interns named ","ev",{"VAR?":"firstName"},"out","/ev","^ ","ev",{"VAR?":"lastName"},"out","/ev","^ working at this lab. ",{"#":"speaker:Guard Bot"},{"#":"portrait:Default"},"\n","^In fact, we don't even take in interns - our coffee machine is fitted with the best path finding algorithm ever created.","\n","^We have not had the need to hire people to bring us coffee for 10 years.","\n","^Hey, let's just talk this out! Bot-to-bot! ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^Hello. My name is Guard Bot. You have tresspassed our lab. Prepare to die. ",{"#":"speaker:Guard Bot"},{"#":"portrait:Default"},"\n",{"#":"puzzle:battle"},"done",{"#f":1}],"battleStart":["^Is this battle gonna be the same?  ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Nope, this bot is programmed differently! ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","^I say you defend as much as you can for this one and then when it's distracted, give it a good smack and hope for the best. ",{"#":"portrait:console_evilexcited"},"\n","^How can I pull *that* off?! ",{"#":"speaker:You"},{"#":"portrait:you_alarmed"},"\n","^How do I defend?","\n","^Geez, you always care about defending most, what a wuss. ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^Looks lke it's going to throw a bunch of new emails from your email inbox at you, hoping you fall for a scam. ",{"#":"portrait:console_neutral"},"\n","^Cycle through them with the arrow keys and toggle their flags as either phishing or legit using the E key.","\n","^Surely, the frustration of its inability to trick you will cause it to self destruct! ",{"#":"portrait:console_evilexcited"},"\n","^Hang on, what if I can't remember what a phshing email looks like? ",{"#":"speaker:You"},{"#":"portrait:you_confused"},"\n","^Then I guess I'll have to give you a recap if I want us to ever make it past this guard... ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^(If you're feeling confident though, feel free to skip the explanation using the Q key) ",{"#":"portrait:console_neutral"},"\n","^The aim of a phishing email is to trick you into giving away your personal information: login credentials, address, full","\n","^name, banking information, etc.","\n","^An email from a legitimate company will not ask you to enter personal information into any webpages linked in the email.","\n","^They will most likely tell you to navigate to their website yourself and log in that way.","\n","^Legit emails will also likely to address you by name or username (though not always). Phishing emails don't do so.","\n","^Here are some other things to look out for that are often features of phishing emails:","\n","^sender address not matching a legit company's address, typos, a sense of urgency, offering jobs you didn't apply for,","\n","^asking for gift cards as payment for something, little to no context to why a webpage is linked, impersonating a friend or","\n","^family member to ask you for help.","\n","^Also it's important to note that not all fake email addresses can be easy to spot.","\n","^Hackers employ a number of techniques to create a legitimate-looking email address.","\n","^When in doubt if an email you received is legit or not, go to the company's official website and contact support.","\n","^It's better to be safe than sorry!","\n","^Enough chit chat! Let's get this over with so I can eat the lunch leftovers before the break ends.  ",{"#":"speaker:Guard Bot"},{"#":"portrait:Default"},"\n","done",{"#f":1}],"battleEnd":["^Good job on your first battle! You won! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Now let's get into the elevator before any more guard bots arrive.","\n","done",{"#f":1}],"battleLost":["^Uh oh, looks like you didn't defeat the guard bot! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^Alright, let's regroup and try fighting it again.","\n","done",{"#f":1}],"global decl":["ev",0,{"VAR=":"passcode"},"str","^","/str",{"VAR=":"receptionistName"},"str","^","/str",{"VAR=":"employeeName"},"str","^","/str",{"VAR=":"firstName"},"str","^","/str",{"VAR=":"lastName"},"/ev","end",null],"#f":1}],"listDefs":{}}