{"inkVersion":20,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"tv1":["^Breaking News! President Long Dusk made a Ribbit post promising to end the Space War if every Subterropolis citizen joins Lava ",{"#":"speaker:TV presenter"},"\n","^Bucket Challenge in city square! (This is a Bring Your Own Lava event)","\n","^I hope you're not going! ",{"#":"speaker:Console"},{"#":"portrait:console_evilexcited"},"\n","^Of course not! I don't have a lava bucket so that would be silly. ",{"#":"speaker:you"},{"#":"portrait:you_neutral"},"\n","^I think you're overlooking 15 other reasons why that would be silly...  ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","done",{"#f":1}],"tv2":["^Buy a jar of our brand new Orangest Orange pigment today! It's so bright that it has been banned in 369 countries for  ",{"#":"speaker:TV presenter"},"\n","^causing blindness, fainting, and belief in Flat Sun!","\n","^Oh no, they found the cause of the Flat Sun belief! I was hoping do study that for my dissertation... ",{"#":"speaker:you"},{"#":"portrait:you_alarmed"},"\n","^Did you trade your brain for that psychology degree? ",{"#":"speaker:Console"},{"#":"portrait:console_neutral"},"\n","done",{"#f":1}],"tv3":["^His Poggerness Long Dusk has kindly sponsored the Zero-Microchip* Vaccination Station! Come get vaccinated for free ",{"#":"speaker:TV presenter"},"\n","^today for a chance to win an updog!","\n","^*Disclaimer: the amount of microchips in each dose have been rounded down to 0.","\n","^What's updog? ",{"#":"speaker:you"},{"#":"portrait:you_confused"},"\n","^Oh no, you fell for it... ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","done",{"#f":1}],"tv4":["^Tired of the slow underground living? Are you missing the flying cars we had before the Space War? Allow us to introduce to you: ",{"#":"speaker:TV presenter"},"\n","^Sonic Shoes TM! They cover all your Gotta Go Fast needs and they can telepathically unlock doors - all for the low, low price of","\n","^This Is A Scam!","\n","^Wow, it's somehow an even better deal than the Intend-To Glitch I got for the price of Clearly A Rip Off! ",{"#":"speaker:you"},{"#":"portrait:you_alarmed"},"\n","^Are you trying to insult me?! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","done",{"#f":1}],"tv5":["^Do you hate the No Food In Theatres rule? Well I bet the underpaid ticket seller won't notice you wearing our ",{"#":"speaker:TV presenter"},"\n","^Snackcessory line of smart watches. Snackcessories: Powered by Bites!","\n","^I hate those, I tried one once and it tasted like battery acid! ",{"#":"speaker:you"},{"#":"portrait:you_alarmed"},"\n","^Then I don't think that smart watch was edible... ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","done",{"#f":1}],"tv6":["^Mildly Interesting News! In the past hour Ribbit has had 10 security breaches, which is 58% less than in the hour before. ",{"#":"speaker:TV presenter"},"\n","^Spectators are infuriated at the loss of their betting money, and we urge the Subterropolis city hacker team to get their &%£#","\n","^together PLEASE I BET ALL MY RENT MONEY ON YOU-","\n","^That's insane! Why is no one concerned about the breaches?! ",{"#":"speaker:Console"},{"#":"portrait:console_wat"},"\n","^What are you talking about? Ribbit Hacking is the most popular E-sport, even all the Cavebuild speedrinning fans are migrating to ",{"#":"speaker:you"},{"#":"portrait:you_alarmed"},"\n","^it!","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}